# LoadNatureName Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LoadBase..::..LoadNatureName Property
LoadBase Class See Also
---
A string representing the nature of the load.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string LoadNatureName { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LoadNatureName As String
	Get
```

Visual C++
---
```text
public:
property String^ LoadNatureName {
	String^ get ();
}
```

# See Also
LoadBase Class
Autodesk.Revit.DB.Structure Namespace